---
kind: property
id: P:Autodesk.Revit.DB.Visual.SolidGlass.SolidglassTransmittanceCustomColor
source: html/950c7f50-2c58-2a4c-417c-a27cba56bd56.htm
---
# Autodesk.Revit.DB.Visual.SolidGlass.SolidglassTransmittanceCustomColor Property

The property labeled "Custom Color" from the "SolidGlass" schema.

## Syntax (C#)
```csharp
public static string SolidglassTransmittanceCustomColor { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.